export default {
	login: {
		title: '約愛派對',
		type: '注冊',
		languageDialog: {
			title: '請選擇你擅長的語言',
		},
		buttons: ['語言', '登錄', '注冊'],
		inputs: ['請輸入你的號碼', '請輸入密碼', '請輸入邀請碼'],
		gender: ['男', '女'],
		message: ['用户名或密码不能为空', '请输入邀请码', '邀请码错误', '登录成功', '注册成功', '你還沒有注冊', '密碼錯誤', '登录失败', '该账号已注册', '用户名或密码不能为空']
	},
	mine: {
		vipStatus: ['製作中…', '未激活', '激活中', '已激活', '待生成'],
		account: '賬戶積分',
		buttons: ['點擊申請', '提領現金', '充值', '修改密碼', '交友安全', '使用條款', '隱私政策', '退出登錄'],
		dialog: {
			input: '输入姓名',
			buttons: ['取消', '确认']
		},
		message:['请输入密码','请输入新密码','密码不能少于六位','两次新密码输入不一致','修改成功','密码错误'],
		model: {
			titles: ['积分', '剩余积分', '提现记录','旧密码','新密码','确认密码'],
			buttons: ['取消', '确认'],
			message: ['请输入积分', {
				title: '系统提示',
				content: '你已经提交了一个申请',
				okText: '我知道了'
			}, '提交成功', '请上传头像', '请输入姓名', '只能上传 JPG/PNG 格式的图片！', '图片大小不能超过 2MB！', '头像上传失败，请稍后重试！'],
		},
		txts: ['数据出错']
	},
	gift: {
		title: '开奖投票',
		buttons: ['提交'],
		txts: ['投票结果', '当前选择', '每单积分'],
		gift: ['玫瑰', '百合', '烟花', '气球'],
		message: ['请选择2份礼物', '请填写积分'],
		dialog: {
			buttons: ['清空订单', '确认提交']
		},
		model: {
			title: '系统错误',
			content: '数据出错',
			okText: '我知道了'
		}
	},
	main: {
		dating: {
			txts: ['提现成功', '充值成功']
		},
		square: {
			buttons: ['点赞', '评论', '分享']
		},
	},
	PL: {
		height: '身高',
		weight: '体重',
		xw: '胸围',
		job: '职业',
		city: '城市',
		button: '我要预约',
		tabs: ['男士专区', '女士专区'],
		party: ['泳池派对', '游艇派对', '别墅派对', '私人派对']
	},


	tabbar: {
		buttons: ['主页', '私约', '投票', '我的']
	},
	message: {
		title: "會員未激活",
		msg: '請聯繫客服激活'
	}
}